{
  "title": "Social Media and Modern Communication",
  "estimatedReadingTime": 12,
  "learningObjectives": [
    "Learn vocabulary related to social media platforms and online interaction",
    "Understand the impact of social media on society and communication",
    "Practice discussing digital citizenship and online safety",
    "Recognize terms related to content creation and digital marketing"
  ],
  "sections": [
    {
      "id": "intro",
      "title": "The Social Media Revolution",
      "type": "introduction",
      "content": "Social media has transformed how we communicate, share information, and connect with others. Platforms like Facebook, Instagram, Twitter, TikTok, and LinkedIn have billions of users worldwide. Understanding social media vocabulary is essential in today's digital age, whether for personal use, professional networking, or business marketing. This lesson explores the language of social media, its benefits and challenges, and how to navigate the digital world responsibly."
    },
    {
      "id": "platforms-features",
      "title": "Social Media Platforms and Features",
      "type": "theory",
      "content": "Different platforms serve different purposes. Facebook connects friends and family through 'posts', 'photos', and 'status updates'. Instagram focuses on visual content - 'photos' and 'videos', with 'stories' that disappear after 24 hours. Twitter uses short 'tweets' (messages) with 'hashtags' (#) to categorize topics. TikTok features short-form videos. LinkedIn is for professional networking. Common features across platforms: 'like' or 'react' to content, 'comment' to respond, 'share' or 'retweet' to spread content, 'follow' users you're interested in, 'tag' people in posts, and send 'direct messages' (DMs) privately. Your 'profile' shows your information and content. 'Notifications' alert you to activity."
    },
    {
      "id": "content-creation",
      "title": "Creating and Sharing Content",
      "type": "theory",
      "content": "'Content creators' or 'influencers' produce material for audiences. They 'post' regularly to maintain 'engagement' - likes, comments, and shares. 'Viral' content spreads rapidly across the internet. 'Algorithms' determine what content users see in their 'feed' or 'timeline'. 'Hashtags' help content reach wider audiences. 'Stories' provide temporary, casual updates. 'Live streaming' broadcasts video in real-time. 'Captions' accompany visual content. 'Filters' and 'editing tools' enhance photos and videos. Building a 'following' or 'audience' takes consistent, quality content. 'Analytics' track performance metrics like 'reach', 'impressions', and 'engagement rate'."
    },
    {
      "id": "impact-challenges",
      "title": "Social Media's Impact and Challenges",
      "type": "theory",
      "content": "Social media offers benefits: staying connected, accessing information, building communities, and business opportunities. However, challenges exist. 'Cyberbullying' harms people online. 'Misinformation' and 'fake news' spread quickly. 'Privacy concerns' arise from data collection. 'Addiction' to social media affects mental health. 'FOMO' (fear of missing out) creates anxiety. 'Echo chambers' expose users only to similar viewpoints. 'Trolls' post inflammatory content. 'Doomscrolling' means endlessly consuming negative news. Balance is crucial - set time limits, verify information before sharing, protect privacy, and remember that online personas don't show complete reality."
    },
    {
      "id": "examples",
      "title": "Social Media Conversations",
      "type": "examples",
      "content": "Example 1: DISCUSSING USAGE - 'I spend too much time scrolling through Instagram. I need to limit my screen time.'\n\nExample 2: CONTENT CREATION - 'I'm trying to grow my following on TikTok by posting daily videos with trending hashtags.'\n\nExample 3: PRIVACY CONCERN - 'I'm worried about my privacy. I've adjusted my settings to limit who can see my posts.'\n\nExample 4: MISINFORMATION - 'Don't believe everything you see online. Always check sources before sharing news.'"
    },
    {
      "id": "summary",
      "title": "Digital Citizenship",
      "type": "summary",
      "content": "Social media is a powerful tool that requires responsible use. Key vocabulary includes platform names, features (post, like, share, follow), and concepts (viral, algorithm, influencer). Be a good 'digital citizen': think before you post, respect others, verify information, protect your privacy, and maintain healthy boundaries. Remember that social media shows curated versions of reality - don't compare your life to others' highlight reels. Use these platforms to connect meaningfully, learn, and share positively. Balance online and offline life for better well-being."
    }
  ],
  "keyVocabulary": [
    {
      "term": "influencer",
      "definition": "A person with the power to affect others' purchasing decisions or opinions",
      "example": "Many brands partner with influencers for marketing campaigns.",
      "pronunciation": "/ˈɪnfluənsər/"
    },
    {
      "term": "viral",
      "definition": "Content that spreads rapidly and widely across the internet",
      "example": "Her video went viral and got millions of views.",
      "pronunciation": "/ˈvaɪrəl/"
    },
    {
      "term": "algorithm",
      "definition": "A set of rules that determines what content users see",
      "example": "The algorithm shows you posts based on your interests.",
      "pronunciation": "/ˈælɡərɪðəm/"
    },
    {
      "term": "engagement",
      "definition": "Interaction with content through likes, comments, and shares",
      "example": "High engagement rates indicate popular content.",
      "pronunciation": "/ɪnˈɡeɪdʒmənt/"
    },
    {
      "term": "hashtag",
      "definition": "A word or phrase preceded by # to categorize content",
      "example": "Use relevant hashtags to increase your post's visibility.",
      "pronunciation": "/ˈhæʃtæɡ/"
    },
    {
      "term": "cyberbullying",
      "definition": "Bullying that takes place online or through digital devices",
      "example": "Schools are working to prevent cyberbullying among students.",
      "pronunciation": "/ˈsaɪbərbʊliɪŋ/"
    }
  ],
  "grammarPoints": [
    {
      "rule": "Social Media Verbs and Phrasal Verbs",
      "explanation": "Social media has created new verbs and uses of existing ones.",
      "examples": [
        "post/upload - I posted a photo on Instagram.",
        "scroll through - I was scrolling through my feed.",
        "log in/out - Don't forget to log out of public computers.",
        "sign up - Sign up for a new account.",
        "check out - Check out this video I found!"
      ],
      "commonMistakes": [
        "Using 'make' instead of 'post': 'I made a post' ❌ → 'I posted' ✓",
        "Confusing 'follow' and 'unfollow': 'I don't follow him anymore' = 'I unfollowed him' ✓"
      ]
    },
    {
      "rule": "Discussing Social Media Trends and Impact",
      "explanation": "Use present perfect for recent trends and present continuous for ongoing situations.",
      "examples": [
        "Social media has changed how we communicate. (impact)",
        "More people are becoming aware of privacy issues. (trend)",
        "TikTok has become extremely popular recently. (recent change)",
        "I've been trying to reduce my screen time. (ongoing effort)"
      ],
      "commonMistakes": [
        "Using simple past for ongoing relevance: 'Social media changed' vs 'has changed' (still relevant)",
        "Forgetting continuous for temporary situations: 'I try to reduce' vs 'I'm trying to reduce' (current effort)"
      ]
    }
  ]
}
